Experiment: Configuring VLANs and Inter-VLAN Routing Using Layer 3 Switches (802.1Q)
Objective:
The objective of this experiment is to configure VLANs, trunking using 802.1Q encapsulation, and inter-VLAN routing on Layer 3 switches using Cisco Packet Tracer. PCs from different VLANs will be able to communicate through the Layer 3 switch's routing capabilities.

Network Setup:
Layer 3 Switch 1 and Layer 3 Switch 2
PC1 (10.0.0.1) and PC2 (10.0.0.2) are in VLAN 10.
PC3 (10.0.0.3) and PC4 (10.0.0.4) are in VLAN 20.
Trunk link between Layer 3 Switch 1 and Layer 3 Switch 2 using 802.1Q encapsulation.
                             ------> PC4 (VLAN 20)
Steps:
1. Create the Network Topology:
Place two Layer 3 switches and four PCs on the Cisco Packet Tracer workspace.
Connect PC1 and PC2 to Layer 3 Switch 1, and PC3 and PC4 to Layer 3 Switch 2.
Connect Layer 3 Switch 1 and Layer 3 Switch 2 with a crossover or regular Ethernet cable (GigabitEthernet/FastEthernet).
2. Assign IP Addresses:
On each PC, go to the Desktop tab and use the IP Configuration tool to assign the following IP addresses:
PC1: 10.0.0.1 / 24
PC2: 10.0.0.2 / 24
PC3: 10.0.0.3 / 24
PC4: 10.0.0.4 / 24
3. Configure VLANs on Layer 3 Switch 1:
Open Switch 1 CLI and enter privileged EXEC mode:

shell
Copy code
Switch1> enable
Switch1# configure terminal
Create VLAN 10 and VLAN 20:

arduino
Copy code
Switch1(config)# vlan 10
Switch1(config-vlan)# name VLAN_10
Switch1(config-vlan)# exit

Switch1(config)# vlan 20
Switch1(config-vlan)# name VLAN_20
Switch1(config-vlan)# exit
Assign PC1 (connected to port FastEthernet0/1) and PC2 (connected to FastEthernet0/2) to VLAN 10:

scss
Copy code
Switch1(config)# interface FastEthernet0/1
Switch1(config-if)# switchport mode access
Switch1(config-if)# switchport access vlan 10
Switch1(config-if)# exit

Switch1(config)# interface FastEthernet0/2
Switch1(config-if)# switchport mode access
Switch1(config-if)# switchport access vlan 10
Switch1(config-if)# exit
Set the trunk port on Switch 1 (assuming GigabitEthernet0/1 connects to Switch 2):

arduino
Copy code
Switch1(config)# interface GigabitEthernet0/1
Switch1(config-if)# switchport mode trunk
Switch1(config-if)# switchport trunk encapsulation dot1q
Switch1(config-if)# switchport trunk allowed vlan 10,20
Switch1(config-if)# exit
4. Configure VLANs on Layer 3 Switch 2:
Open Switch 2 CLI and enter privileged EXEC mode:

shell
Copy code
Switch2> enable
Switch2# configure terminal
Create VLAN 10 and VLAN 20:

arduino
Copy code
Switch2(config)# vlan 10
Switch2(config-vlan)# name VLAN_10
Switch2(config-vlan)# exit

Switch2(config)# vlan 20
Switch2(config-vlan)# name VLAN_20
Switch2(config-vlan)# exit
Assign PC3 (connected to port FastEthernet0/1) and PC4 (connected to FastEthernet0/2) to VLAN 20:

scss
Copy code
Switch2(config)# interface FastEthernet0/1
Switch2(config-if)# switchport mode access
Switch2(config-if)# switchport access vlan 20
Switch2(config-if)# exit

Switch2(config)# interface FastEthernet0/2
Switch2(config-if)# switchport mode access
Switch2(config-if)# switchport access vlan 20
Switch2(config-if)# exit
Set the trunk port on Switch 2 (assuming GigabitEthernet0/1 connects to Switch 1):

arduino
Copy code
Switch2(config)# interface GigabitEthernet0/1
Switch2(config-if)# switchport mode trunk
Switch2(config-if)# switchport trunk encapsulation dot1q
Switch2(config-if)# switchport trunk allowed vlan 10,20
Switch2(config-if)# exit
5. Configure Inter-VLAN Routing on Switch 1:
On Switch 1, enable IP routing to route between VLANs:

arduino
Copy code
Switch1(config)# ip routing
Create SVIs (Switch Virtual Interfaces) for VLAN 10 and VLAN 20:

For VLAN 10:

arduino
Copy code
Switch1(config)# interface vlan 10
Switch1(config-if)# ip address 10.0.0.254 255.255.255.0
Switch1(config-if)# no shutdown
Switch1(config-if)# exit
For VLAN 20:

arduino
Copy code
Switch1(config)# interface vlan 20
Switch1(config-if)# ip address 10.0.0.253 255.255.255.0
Switch1(config-if)# no shutdown
Switch1(config-if)# exit
6. Configure PCs for Default Gateway:
Set the default gateway on PC1 and PC2 to 10.0.0.254 (VLAN 10 gateway).
Set the default gateway on PC3 and PC4 to 10.0.0.253 (VLAN 20 gateway).